#ifndef __car__
#define __car__

//------------------------------------------------------------------------------
// car.h - содержит описание легкового автомобиля
//------------------------------------------------------------------------------

#include "rnd.h"
#include "vehicle.h"
#include "stdio.h"

//------------------------------------------------------------------------------
// треугольник
struct car: vehicle {
    short maxSpeed; // максимальная скорость
};

// Ввод параметров автомобиля из файла
void In(car &c, FILE *fp);

// Случайный ввод параметров автомобиля
void InRnd(car &c);

// Вывод параметров автомобиля в файл
void Out(car &c, FILE *fp);

// Вычисление максимального расстояния автомобиля
double Distance(car &c);

#endif //__car__
